In [26]:
import pandas as pd

In [27]:
data = {
    "Name" : ["A","B","C","D","A","C"],
    "Eng" :[8,7,5,6,8,5],
    "hindi":[2,3,4,5,2,6]
}

In [28]:
df= pd.DataFrame(data)

In [29]:
df

  Name  Eng  hindi
0    A    8      2
1    B    7      3
2    C    5      4
3    D    6      5
4    A    8      2
5    C    5      6

In [30]:
df.duplicated()

0    False
1    False
2    False
3    False
4     True
5    False
dtype: bool

In [31]:
df

  Name  Eng  hindi
0    A    8      2
1    B    7      3
2    C    5      4
3    D    6      5
4    A    8      2
5    C    5      6

In [33]:
df.drop_duplicates()

  Name  Eng  hindi
0    A    8      2
1    B    7      3
2    C    5      4
3    D    6      5
5    C    5      6

In [35]:
df.drop_duplicates(inplace=True)

In [36]:
df

  Name  Eng  hindi
0    A    8      2
1    B    7      3
2    C    5      4
3    D    6      5
5    C    5      6

#big dataset work

In [37]:
x = pd.read_csv("Diabetes Missing Data.csv")

In [38]:
x.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
763    False
764    False
765    False
766    False
767    False
Length: 768, dtype: bool

In [41]:
x.shape

(768, 9)

In [42]:
x.drop_duplicates(inplace = True)

In [43]:
x.shape

(768, 9)